
## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.enable_temp_tablespaces_on_local_ssd&#34;]
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.enable_temp_tablespaces_on_local_ssd"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.enable_temp_tablespaces_on_local_ssd"
      + server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/juror-api-stg"
      + value     = "off"
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-stg"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-stg-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-stg.vault.azure.net/secrets/juror-api-flexible-stg-read-user-name/9288bfd2b2f946b798a9dd47dfb885b1" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.KeyVault/vaults/mi-vault-stg" # forces replacement -> (known after apply) # forces replacement
        name                    = "juror-api-flexible-stg-read-user-name"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.KeyVault/vaults/mi-vault-stg/secrets/juror-api-flexible-stg-read-user-name/versions/9288bfd2b2f946b798a9dd47dfb885b1" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.KeyVault/vaults/mi-vault-stg/secrets/juror-api-flexible-stg-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "9288bfd2b2f946b798a9dd47dfb885b1" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-stg.vault.azure.net/secrets/juror-api-flexible-stg-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-stg.vault.azure.net/secrets/juror-api-flexible-stg-read-user-password/32fc12bfc3454e1abbc8605496380a4a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.KeyVault/vaults/mi-vault-stg" # forces replacement -> (known after apply) # forces replacement
        name                    = "juror-api-flexible-stg-read-user-password"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.KeyVault/vaults/mi-vault-stg/secrets/juror-api-flexible-stg-read-user-password/versions/32fc12bfc3454e1abbc8605496380a4a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/mi-stg-rg/providers/Microsoft.KeyVault/vaults/mi-vault-stg/secrets/juror-api-flexible-stg-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "32fc12bfc3454e1abbc8605496380a4a" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-stg.vault.azure.net/secrets/juror-api-flexible-stg-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":202,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->